app/views/lessons/_user_lesson.html.erb

<div id="<%= dom_id lesson %>" class="dashboard_lesson">
    <%post = Post.find_by(id: lesson.number)%>
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]