app/views/lessons/dashboard.html.erb

        <% @lessons.each do |lesson|%>
        <%post = Post.find_by(id: lesson.number)%>
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]