app/controllers/lessons_controller.rb

  def lessons_by_user
    lessons = Lesson.all
    lessons.select do |lesson|
---
SELECT "lessons".* FROM "lessons"