app/controllers/lessons_controller.rb

SELECT "posts".* FROM "posts"
---
  def dashboard
    @lessons = lessons_by_user
    @post = Post.all

SELECT "lessons".* FROM "lessons"
---
  def lessons_by_user
    lessons = Lesson.all
    lessons.select do |lesson|