app/controllers/posts_controller.rb

  def toggle_complete
    @lesson = find_current_lesson
    @lesson.is_completed = !@lesson.is_completed
    @lesson.save
    post = Post.find(params[:id])
---
UPDATE "lessons" SET "updated_at" = ?, "is_completed" = ? WHERE "lessons"."id" = ?  [["updated_at", "2023-09-12 10:34:49.857458"], ["is_completed", 0], ["id", 2]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def find_current_lesson
    current_post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def lessons_by_user
      lessons = Lesson.all
      lessons.select do |lesson|
---
SELECT "lessons".* FROM "lessons"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?