app/models/user.rb

SELECT "users".* FROM "users" WHERE (lower(name) = 'genesis' OR lower(email) = 'genesis') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def self.find_for_database_authentication(warden_conditions)
    conditions = warden_conditions.dup
      if (login = conditions.delete(:login))
        where(conditions.to_h).where(["lower(name) = :value OR lower(email) = :value", { :value => login.downcase }]).first
      elsif conditions.has_key?(:name) || conditions.has_key?(:email)
        where(conditions.to_h).first