app/controllers/users/registrations_controller.rb

  def create
    super do |created_user|
      Post.all.each_with_index do |post, index|
      post_number = index + 1
      lesson = Lesson.create(number: post_number, user_id: created_user.id)
---
SELECT "posts".* FROM "posts"
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "lessons" ("number", "user_id", "created_at", "updated_at", "is_completed") VALUES (?, ?, ?, ?, ?)  [["number", 1], ["user_id", 2], ["created_at", "2023-09-17 20:28:31.768837"], ["updated_at", "2023-09-17 20:28:31.768837"], ["is_completed", 0]]